In [1]:
pip install load_MySQL

Requirement already satisfied: load_MySQL in c:\users\meetp\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (0.1)
Requirement already satisfied: ensure==1.0.2 in c:\users\meetp\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from load_MySQL) (1.0.2)
Requirement already satisfied: py-youtube==1.1.7 in c:\users\meetp\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from load_MySQL) (1.1.7)
Requirement already satisfied: six>=1.11.0 in c:\users\meetp\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from ensure==1.0.2->load_MySQL) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
from sql_connect.MySQL import MySQLOperation

##

#### Database Credentials

In [3]:
db = MySQLOperation(host="localhost", user="root", password="1234", database="meet")
db.connect()

Connected to the MySQL database

##

#### Running any Select query

In [4]:
query1 = "SELECT * FROM student"
student_records_df = db.execute_query(query1)
student_records_df.tail()

    id        name  class  mark  gender
32  33   Kenn Rein    Six    96  female
33  34    Gain Toe  Seven    69    male
34  35  Rows Noump    Six    88  female
35  36     stephan  Seven    83    male
36  37       roman    Six    65    male

- select query is stored in pandas DataFrame to perform all the analysis using python

##

In [5]:
query1 = """
CREATE TABLE IF NOT EXISTS temp_table (
    id INT,
    name VARCHAR(255),
    class VARCHAR(255),
    mark INT,
    gender VARCHAR(255)
)
"""
db.execute_query(query1)

Empty DataFrame
Columns: []
Index: []

#### More Select Queries

In [6]:
query1 = """
SELECT * 
FROM student
Where mark > 90
"""
student_records_df = db.execute_query(query1)
student_records_df

   id       name class  mark  gender
0  12      Recky   Six    94  female
1  33  Kenn Rein   Six    96  female

In [7]:
query1 = """
SELECT 
name,
mark 
FROM student 
WHERE name LIKE 'A%' AND mark > 50;
"""
student_records_df = db.execute_query(query1)
student_records_df

        name  mark
0     Arnold    55
1  Alex John    55
2     Asruid    85

In [8]:
query1 = """
SELECT gender,
AVG(mark) AS avg_mark
FROM student
GROUP BY gender;
"""
student_records_df = db.execute_query(query1)
student_records_df

   gender avg_mark
0  female  77.5294
1    male  72.1500

In [9]:
query1 ="""
SELECT class,
MAX(mark) AS max_mark
FROM student
GROUP BY class
HAVING max_mark > 80;
"""
student_records_df = db.execute_query(query1)
student_records_df

   class  max_mark
0   Four        88
1  Three        85
2   Five        85
3    Six        96
4  Seven        90

In [10]:
query1 ="""
SELECT class,
MAX(mark) AS max_mark
FROM student
GROUP BY class
HAVING max_mark > 80;
"""
student_records_df = db.execute_query(query1)
student_records_df

   class  max_mark
0   Four        88
1  Three        85
2   Five        85
3    Six        96
4  Seven        90

- this is just an overview and working of the sql SELECT Query you can try it from your own

##

### More Common CRUD Operations

#### Insert Data

In [11]:
insert_query = """
INSERT INTO student (id, name, class, mark, gender)
VALUES (38, 'jacob', 'Four', 56, 'male'),
       (39, 'Samantha', 'Six', 79, 'female');
"""
db.insert_record(insert_query)

Record inserted successfully

#### Update data

In [12]:
query3 = "UPDATE student SET mark = 35 WHERE id = 1"
db.update_record(query3)

Record updated successfully

#### Delete data

In [13]:
query4 = "DELETE FROM student WHERE id in (38,39)"
db.delete_record(query4)

Record deleted successfully

##

### Some other commonly used Operations

#### Alter Table

In [14]:
query5 = "ALTER TABLE student ADD COLUMN email VARCHAR(255)"
db.execute_alter(query5)

Alter executed successfully

#### Modify table

In [16]:
query8 = "ALTER TABLE student MODIFY mark INT"
db.execute_modify(query8)

Modify executed successfully

#### Truncate table

In [17]:
query_temp_truncate = "TRUNCATE TABLE temp_table"
db.execute_query(query_temp_truncate)

Empty DataFrame
Columns: []
Index: []

#### Drop table

In [18]:
query_temp_drop = "DROP TABLE IF EXISTS temp_table"
db.execute_query(query_temp_drop)

Empty DataFrame
Columns: []
Index: []

##

### Disconnect from the MySQL database

In [19]:
db.disconnect()

Disconnected from the MySQL database

##

### Important Notes
- Package does not proceed to have all the features which official mysql package has, This is the first release and in future more features will be added till then happy coding